/*-----------------------------------------------
  名称：产生多路不同频率的方波
  微信公众号：电子开发之家
  编写：小树
  版本：Version 1.0
  内容：通过定时器0产生多路不同频率的方波 
----------------------------------------------*/
#include<reg52.h> //包含头文件，一般情况不需要改动，头文件包含特殊功能寄存器的定义

/*------------------------------------------------
                    定时器初始化子程序
------------------------------------------------*/
void Init_Timer0(void)
{
 TMOD |= 0x01;	              //使用模式1，16位定时器，使用"|"符号可以在使用多个定时器时不受影响		     
 TH0=(65536-500)/256;	      //给定初值，这里使用定时器最大值从500开始计数一直到65535溢出
 TL0=(65536-500)%256;		  //12M晶振计算指令周期1us,1ms方波半个周期500us，即定时500次
 EA=1;                        //总中断打开
 ET0=1;                       //定时器中断打开
 TR0=1;                       //定时器开关打开
}
/*------------------------------------------------
                    主程序
------------------------------------------------*/
main()
{
 Init_Timer0();
 while(1);
}

/*------------------------------------------------
                 定时器中断子程序
------------------------------------------------*/
void Timer0_isr(void) interrupt 1 using 1
{
 static unsigned char i;

 TH0=(65536-500)/256;		  	 //重新赋值 
 TL0=(65536-500)*256;        

 i++;
 P1=i; //P1口8路输出不同频率，相当于一个分频器，高频用示波
       //器测量，低频可以直接用led观测
       //P1.0输出1ms方波，P1.1输出2ms，p1.2输出4ms，以此类推

}
